Gregification/cse-labs/homelab/tm4c123gfiddle/cse4352_spring2025_project2/src/framework/ethernet.c
                putsUart0("  IP: ");
                getIpAddress(ip.bytes);
                    ip.raw = ntohl(ip.raw);
                IPv4tostring(&ip, str);
                str[sizeof(str)-1] = '\0';
                putsUart0(str);


                putsUart0("\n\r  MQTT broker: ");
                getIpMqttBrokerAddress(ip.bytes);
                    ip.raw = ntohl(ip.raw);
                IPv4tostring(&ip, str);
                str[sizeof(str)-1] = '\0';
                putsUart0(str);

                putsUart0("\n\r  state: ");

                if(!mqttsocket)
                    putsUart0("socket DNE");
                else {
                    snprintf(str, sizeof(str)-1, "port: %1hhd\n\r  ", mqttsocket->localPort);
                    str[sizeof(str)-1] = '\0';
                    putsUart0(str);
                    switch(mqttsocket->state){
                        case TCP_CLOSED:        putsUart0("TCP_CLOSED"); break;
                        case TCP_LISTEN:        putsUart0("TCP_LISTEN"); break;
                        case TCP_SYN_RECEIVED:  putsUart0("TCP_SYN_RECEIVED"); break;
                        case TCP_SYN_SENT:      putsUart0("TCP_SYN_SENT"); break;
                        case TCP_ESTABLISHED:   putsUart0("TCP_ESTABLISHED"); break;
                        case TCP_FIN_WAIT_1:    putsUart0("TCP_FIN_WAIT_1"); break;
                        case TCP_FIN_WAIT_2:    putsUart0("TCP_FIN_WAIT_2"); break;
                        case TCP_CLOSING:       putsUart0("TCP_CLOSING"); break;
                        case TCP_CLOSE_WAIT:    putsUart0("TCP_CLOSE_WAIT"); break;
                        case TCP_LAST_ACK:      putsUart0("TCP_LAST_ACK"); break;
                        case TCP_TIME_WAIT:     putsUart0("TCP_TIME_WAIT"); break;
                        default:                putsUart0("unknown TCP state"); break;
                    }
                    putsUart0("\n\r  ");
                    if(mqttsocket->state == TCP_ESTABLISHED){
                        switch(mqttstate){
                            case MQTT_CONNECTED:    putsUart0("MQTT_CONNECTED"); break;
                            case MQTT_DISCONNECTED: putsUart0("MQTT_DISCONNECTED"); break;
                            case MQTT_SENT_CONN:    putsUart0("MQTT_SENT_CONN"); break;
                            default:                putsUart0("unknown MQTT state"); break;
                        }
                    } else
                        putsUart0("MQTT not established");
                }
            }
            if (strcmp(token, "set") == 0)
            {
                token = strtok(NULL, " ");
                if (strcmp(token, "ip") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpAddress(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_IP, *p32);
                }
                if (strcmp(token, "sn") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpSubnetMask(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_SUBNET_MASK, *p32);
                }
                if (strcmp(token, "gw") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpGatewayAddress(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_GATEWAY, *p32);
                }
                if (strcmp(token, "dns") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpDnsAddress(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_DNS, *p32);
                }
                if (strcmp(token, "time") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpTimeServerAddress(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_TIME, *p32);
                }
                if (strcmp(token, "mqtt") == 0)
                {
                    for (i = 0; i < IP_ADD_LENGTH; i++)
                    {
                        token = strtok(NULL, " .");
                        ip[i] = asciiToUint8(token);
                    }
                    setIpMqttBrokerAddress(ip);
                    p32 = (uint32_t*)ip;
                    writeEeprom(EEPROM_MQTT, *p32);
                    ArpFind((uint8_t *)p32);
                }
            }

            if (strcmp(token, "host") == 0)
            {
                p2HostStart();
            }

            if (strcmp(token, "join") == 0)
            {
                p2ClientJoin();
            }

            if (strcmp(token, "stop") == 0)
            {
                p2State = P2_STATE_OFF;
                p2estate = P2ESTATE_NONE;
                p2StopFrameTimer();
            }

            if (strcmp(token, "auto") == 0)
            {
                p2estate = P2ESTATE_AUTO;
            } else {
                p2estate = P2ESTATE_NONE;
                p2State = P2_STATE_OFF;
            }

            if (strcmp(token, "help") == 0)
            {
                putsUart0("Commands:\n\r");
                putsUart0("  mqtt ACTION [USER [PASSWORD]]\n\r");
                putsUart0("    where ACTION = {connect|disconnect|publish TOPIC DATA\n\r");
                putsUart0("                   |subscribe TOPIC|unsubscribe TOPIC}\n\r");
                putsUart0("  status\n\r");
                putsUart0("  ip\n\r");
                putsUart0("  reboot\n\r");
                putsUart0("  set ip|gw|dns|time|mqtt|sn w.x.y.z\n\r");
                putsUart0("  host\n\r");
                putsUart0("  stop\n\r");
                putsUart0("  auto : automatically tries to start acting like a wireless bridge\n\r");

                dumpHelp();
            }

            putsUart0("\n\r> ");
        }
    }
}

