Gregification/cse-labs/homelab/tm4c123gfiddle/cse4352_spring2025_project2/src/framework/ethernet.c
//-----------------------------------------------------------------------------
// Main
//-----------------------------------------------------------------------------

int main(void)
{
    uint8_t buffer[MAX_PACKET_SIZE];
    etherHeader * data = (etherHeader*) buffer;

    // Init controller
    initHw();

    // Setup UART0
    initUart0();
    setUart0BaudRate(UART0_BAUD, F_CPU);

    // Init timer
    initTimer();

    // Init sockets
    initSockets();

    // Init ethernet interface (eth0)
    putsUart0("\n\rUTA cse4352 spring2025 project 2. Team14\n\r");
    initEther(ETHER_UNICAST | ETHER_BROADCAST | ETHER_HALFDUPLEX);
    setEtherMacAddress(2, 3, 4, 5, 6, 105);

    // Init EEPROM
    initEeprom();
    readConfiguration();

    // Init arp
    initArp();

    // init tcp sockets
    initTcp();

    initNrf();

    // test NRF connection
    setSpi0BaudRate(NRF_SPI_BAUD, F_CPU);
    while(!nrfTestSPI()){
        setPinValue(RED_LED, 1);
        setPinValue(GREEN_LED, 0);
        waitMicrosecond(100e3);
        setPinValue(RED_LED, 0);
        setPinValue(GREEN_LED, 1);
        waitMicrosecond(100e3);
    }
    setSpi0BaudRate(ETH_SPI_BAUD, F_CPU);

    setPinValue(GREEN_LED, 1);
    waitMicrosecond(1e6);
    setPinValue(GREEN_LED, 0);
    waitMicrosecond(1e6);

    {
        socket buff_s;

        buff_s.localPort = 0;
//        getIpMqttBrokerAddress(s.remoteIpAddress);
        buff_s.remotePort = 0;

        for(uint8_t i = 0; i < HW_ADD_LENGTH; i++)
            buff_s.remoteHwAddress[i] = 0xff;
        for(uint8_t i = 0; i < IP_ADD_LENGTH; i++)
            buff_s.remoteIpAddress[i] = 0xff;

        buff_s.sequenceNumber = random32();
        buff_s.acknowledgementNumber = 0;

        // dummy message to indicate presence
        sendTcpMessage(data, &buff_s, RST, 0, 0);
    }
    {
        IPv4 src, dest;
        getIpMqttBrokerAddress(dest.bytes);
        getIpAddress(src.bytes);
        sendArpRequest(data, src.bytes, dest.bytes);
    }

    // Main Loop
    // RTOS and interrupts would greatly improve this code,
    // but the goal here is simplicity

    p2estate = P2ESTATE_AUTO;
    while (true)
    {

        // nrf stuff
        // only differing baud rate, spi mode is the same

        {
            switch(p2State){
                default:
                case P2_STATE_OFF:
                    break;

                case P2_STATE_HOST_START:
                case P2_STATE_HOSTING:
                    setSpi0BaudRate(NRF_SPI_BAUD, F_CPU);
                    p2HostLoop();
                    setSpi0BaudRate(ETH_SPI_BAUD, F_CPU);
                    break;

                case P2_STATE_CLIENT_START:
                case P2_STATE_CLIENT_WAIT_CONN_ACK:
                case P2_STATE_CLIENTING:
                    setSpi0BaudRate(NRF_SPI_BAUD, F_CPU);
                    p2ClientLoop();
                    setSpi0BaudRate(ETH_SPI_BAUD, F_CPU);
                    break;
            }
        }

        // ethernet stuff

        // Terminal processing here
        processShell(data);

        updateSocketInfos(data);

        // TCP pending messages
        sendTcpPendingMessages(data);

        switch(p2estate){
                    default:
                    case P2ESTATE_NONE:
                        break;

                    case P2ESTATE_AUTO:{
                            putsUart0("|///|auto mode|\\\\\\| ");
                            if(p2State == P2_STATE_OFF){
                                p2HostStart();
                                putsUart0("starting wireless host");
                                putsUart0("\n\r");
                                break;
                            }

                            static uint8_t t_counter;
                            if(!mqttsocket || (mqttsocket->state == TCP_CLOSED) || (mqttsocket->state == TCP_ESTABLISHED && mqttstate == MQTT_DISCONNECTED)){
                                if(t_counter == 0)
                                    connectMqtt(data);
                                t_counter = (t_counter + 1) % 10;
                            }

                            putsUart0("wireless: ");
                            switch(p2State){
                                case P2_STATE_CLIENTING:
                                    putsUart0("CLIENTING            ");
                                    break;
                                case P2_STATE_CLIENT_START:
                                    putsUart0("CLIENT_START         ");
                                    break;
                                case P2_STATE_CLIENT_WAIT_CONN_ACK:
                                    putsUart0("CLIENT_WAIT_CONN_ACK ");
                                    break;
                                case P2_STATE_HOSTING:
                                    putsUart0("HOSTING              ");
                                    break;
                                case P2_STATE_HOST_START:
                                    putsUart0("HOST_START           ");
                                    break;
                                case P2_STATE_OFF:
                                    putsUart0("OFF                  ");
                                    break;
                                default:
                                    putsUart0("<unknown>            ");
                                    break;
                            }
                            putsUart0("| ethernet: ");


                            if(mqttsocket){
                                switch(mqttsocket->state){
                                    case TCP_CLOSED:        putsUart0("TCP_CLOSED       "); break;
                                    case TCP_LISTEN:        putsUart0("TCP_LISTEN       "); break;
                                    case TCP_SYN_RECEIVED:  putsUart0("TCP_SYN_RECEIVED "); break;
                                    case TCP_SYN_SENT:      putsUart0("TCP_SYN_SENT     "); break;
                                    case TCP_ESTABLISHED:   putsUart0("TCP_ESTABLISHED  "); break;
                                    case TCP_FIN_WAIT_1:    putsUart0("TCP_FIN_WAIT_1   "); break;
                                    case TCP_FIN_WAIT_2:    putsUart0("TCP_FIN_WAIT_2   "); break;
                                    case TCP_CLOSING:       putsUart0("TCP_CLOSING      "); break;
                                    case TCP_CLOSE_WAIT:    putsUart0("TCP_CLOSE_WAIT   "); break;
                                    case TCP_LAST_ACK:      putsUart0("TCP_LAST_ACK     "); break;
                                    case TCP_TIME_WAIT:     putsUart0("TCP_TIME_WAIT    "); break;
                                    default:                putsUart0("unknown TCP state"); break;
                                }

                                if(mqttsocket->state != TCP_ESTABLISHED){
                                    putsUart0("\n\r");
                                    break;
                                }

                                putsUart0(" > ");

                                switch(mqttstate){
                                    case MQTT_CONNECTED:    putsUart0("MQTT_CONNECTED    "); break;
                                    case MQTT_DISCONNECTED: putsUart0("MQTT_DISCONNECTED "); break;
                                    case MQTT_SENT_CONN:    putsUart0("MQTT_SENT_CONN    "); break;
                                    default:                putsUart0("unknown MQTT state"); break;
                                }

                                putsUart0("\n\r");
                            }
                        }break;

