Gregification/cse-labs/homelab/tm4c123gfiddle/cse4352_spring2025_project2/src/framework/ethernet.c
                }

        // Packet processing
        if (isEtherDataAvailable())
        {
            if (isEtherOverflow())
            {
                setPinValue(RED_LED, 1);
                waitMicrosecond(1e6);
                setPinValue(RED_LED, 0);
            }

            // Get packet
            getEtherPacket(data, MAX_PACKET_SIZE);

            // Handle ARP request
            if (isArpRequest(data))
                sendArpResponse(data);
            else if(isArpResponse(data))
                addArpEntry(data, ARP_ENTRY_PRIORITY_MAX / 2);

            // Handle IP datagram
            if (isIp(data))
            {
                ipHeader * ip = (ipHeader*)data->data;
                tcpHeader * tcp = (tcpHeader*)((uint8_t*)ip + (ip->size * 4));
                uint16_t datalen = ntohs(ip->length) - ip->size * 4 - sizeof(tcpHeader);

            	if (isIpUnicast(data))
            	{
            	    // Handle ICMP ping request
                    if (isPingRequest(data))
                    {
                        sendPingResponse(data);
                        continue;
                    }

                    // Handle TCP datagram
                    if (isTcp(data))
                    {
                        socketInfo * si;
                        if (si = isTcpPortOpen(data))
                        {
                            // updates tcp state machine
                            processTcpResponse(si, data);

                            if(datalen){
                                uint8_t * packet_end = tcp->data + datalen;

                                mqttFixedHeader fh;
                                unpackMqttFH(&fh, tcp->data, sizeof(mqttFixedHeader)+1);
                                // manually adjust pointer since unpackMqttFH is giving some crazy results
                                uint8_t * dater = tcp->data+1;
                                while(dater++[0] & BV(7))
                                    ;

                                switch(fh.type){
                                    default: break;

                                    case MQTT_FH_TYPE_CONNACK:
                                        mqttstate = MQTT_CONNECTED;
                                        break;

                                    case MQTT_FH_TYPE_DISCONNECT:
                                        mqttstate = MQTT_DISCONNECTED;
                                        closeTcpConnSoft(si->sock, data, 0);
                                        break;

                                    case MQTT_FH_TYPE_PUBLISH: {

                                        // dump data
                                        uint16_t topic_len  = ntohs(((uint16_t *)(dater))[0]);
                                        dater += 2;

                                        putsUart0("\n\r topic: ");
                                        for(; topic_len > 0; topic_len--)
                                            putcUart0(dater++[0]);

                                        putsUart0("\n\r message: ");
                                        while(dater < packet_end)
                                            putcUart0(dater++[0]);

                                        putsUart0("\n\r");
                                    }
                                    break;

                                    case MQTT_FH_TYPE_PINGREQ :
                                        fh.type = MQTT_FH_TYPE_PINGRESP;
                                        packMqttFH(&fh, dater, datalen + 1);
                                        sendTcpMessage(data, mqttsocket, ACK, dater, datalen);
                                        break;
                                }
                            }

                        } else {
                            if(!tcp->fRST){
                                socket s;
                                if(tcp->fFIN)
                                    sendTcpResponseFromEther(data, &s, FIN | ACK);
                                else
                                    sendTcpResponseFromEther(data, &s, RST | ACK);
                            }
                        }
                    }
            	}
            }
        }
    }
}

void dumpHelp(){
    putsUart0("\n\r");
    putsUart0(" ------------------------------------------------------------\n\r");
    putsUart0("\n\rCSE4352 spring2025 project 2 team 14. \n\r");
    putsUart0("     last update: 4/18/2025 12:06pm \n\r");
    putsUart0("     reach team 14 here: ygb5713@mavs , or IOT discord channel (link on lab whiteboard)\n\r");
    putsUart0(" ------------------------------------------------------------\n\r");
    putsUart0("\n\r");
    putsUart0("- does not do anything with ethernet.\n\r");
    putsUart0("- 1 Mbps, channel "); { char str[10]; snprintf(str, sizeof(str), "%d\n\r", NRF_F_CHANNEL); putsUart0(str); }
    putsUart0("- on some red-boards R/TX  or dosen't work, try swapping boards.\n\r");
    putsUart0("- bug where clients can both join the same frame. solution: wait for one client to join before starting the other\n\r");
    putsUart0("- crc8-ccitt calcualtion -> https://srecord.sourceforge.net/crc16-ccitt.html#source\n\r");
    putsUart0("- supported teams: \n\r");
    putsUart0("     * if the packet format isnt what you would like, or your team is not listed, then contact me.\n\r");
    putsUart0("     - GLASS_BREAK_SENSOR\n\r");
    putsUart0("     - WEATHER_STATION\n\r");
    putsUart0(" ------------------------------------------------------------\n\r");
    putsUart0("- red/green led's flashing on start indicate SPI connection failed. (unable to R/W to NRF)\n\r");
    putsUart0("- when hosting : green led toggles every new frame\n\r");
    putsUart0("- when clienting : green led is on when its the devices turn to transmit\n\r");
    putsUart0("- in RX or TX mode the led just does stuff, ignore it. \n\r");
    putsUart0("\n\r");
    putsUart0(" ------------------------------------------------------------\n\r");
    putsUart0("      ______________________________________\n\r");
    putsUart0("      | |------|                            |\n\r");
    putsUart0("      | | A  B |      ______  _____________ |\n\r");
    putsUart0("      | | C  D |     |      |/   |   ______||\n\r");
    putsUart0("      | | E  F |     | RFIC |    |  |______ |\n\r");
    putsUart0("      | | G  H |     |______|    |   ______||\n\r");
    putsUart0("      | |------|   ____________  |  |______ |\n\r");
    putsUart0("      |           | oscillator |           ||\n\r");
    putsUart0("      |___________|____________|___________||\n\r");
    putsUart0("\n\r");
    putsUart0("  NRF module                      TM4C pin        Note\n\r");
    putsUart0("  A: GND                          GND\n\r");
    putsUart0("  B: VCC (3.3V)                   3.3v\n\r");
    putsUart0("  C: Chip enable (active high)    PE2             enables tx/rx , does not effect SPI communication\n\r");
    putsUart0("  D: CS (active low)              PA7\n\r");
    putsUart0("  E: SCK                          PA2\n\r");
    putsUart0("  F: MOSI                         PA5\n\r");
    putsUart0("  G: MISO                         PA4\n\r");
    putsUart0("  H: IRQ                          PE3\n\r");
    putsUart0("\n\r");
    putsUart0(" ------------------------------------------------------------\n\r");
}

